      *-----------------------------------------------------------------
      * Renglón del archivo de texto de salida.
      *-----------------------------------------------------------------
       FD  TEXT-FILE.
       01  TEXT-LINE                   PIC X(1000).
