      *-----------------------------------------------------------------
      * Parámetro recibido por todos los módulos: directorio de datos.
      *-----------------------------------------------------------------
       01  LK-DIRECTORIO-DATOS         PIC X(200).
